# FillGrid Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillGrid Constructor
FillGrid Class See Also
---
Creates a simple fill grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public FillGrid()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FillGrid()
```

# See Also
FillGrid Class
FillGrid Overload
Autodesk.Revit.DB Namespace